Table of Contents
 Class ConnectionInfo
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Provides information about connection
[DataContract]
public class ConnectionInfo
Inheritance
object
ConnectionInfo
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Description
The description of the connection
[DataMember]
public string Description { get; set; }
Property Value
string
 Id
The id of the connection
[DataMember]
public int Id { get; set; }
Property Value
int
 Identifier
The identifier of the connection
[DataMember]
public string Identifier { get; set; }
Property Value
string
 Name
The name of the connection
[DataMember]
public string Name { get; set; }
Property Value
string
 Edit this page